Revit 2026 API

# WallRemoveAttachment(ElementId) Method

---

Removes any attachment of the wall to the specified target.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveAttachment(
	ElementId targetId
)
```
```vb
Public Sub RemoveAttachment (
	targetId As ElementId
)
```
```cpp
public:
void RemoveAttachment(
	ElementId^ targetId
)
```
```fsharp
member RemoveAttachment :
        targetId : ElementId -> unit
```

#### Parameters

targetId ElementId
     Target element id.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Wall Class

RemoveAttachment Overload

Autodesk.Revit.DB Namespace